Repository: tseignette/angular-boilerplate
Catalog: src/locale/messages.*.xlf
Languages: fr

source: <a [href]="isEnglish ? 'fr' : '../'">Français</a>
fr: <a [href]="isEnglish ? 'fr' : '../'">English</a>

source: Angular boilerplate
fr: Boilerplate Angular

source: Angular 11 boilerplate with <a href="https://picturepan2.github.io/spectre" target="_blank">Spectre.css</a>, i18n, static prerendering and some common resources.
fr: Boilerplate Angular 11 avec <a href="https://picturepan2.github.io/spectre" target="_blank">Spectre.css</a>, l'i18n, le pré-rendu statique et des ressources courantes.

source: Getting started
fr: Démarrage

source: Install everything with <code>npm install</code>, then:
fr: Installez tout avec <code>npm install</code>, puis :

source: <code>npm start</code> to start the project locally on <a>http://localhost:4200</a> (accessible through local network)
fr: <code>npm start</code> pour lancer le projet en local sur <a>http://localhost:4200</a> (accessible sur le réseau local)

source: <code>npm run start:fr</code> does the same using the French locale
fr: <code>npm run start:fr</code> fait la même chose en utilisant la localisation française

source: <code>npm lint</code> to lint (the default configuration has not been modified)
fr: <code>npm lint</code> pour linter (la configuration par défaut n'a pas été modifiée)

source: <code>npm run extract</code> to extract the source language file in <b>src/locale</b>
fr: <code>npm run extract</code> pour extraire le fichier de la langue source dans<b>src/locale</b>

source: <code>npm run build</code> to build for production, files are generated in <b>dist/angular-boilerplate/browser</b>
fr: <code>npm run build</code> pour générer la version de production, les fichiers sont générés dans <b>dist/angular-boilerplate/browser</b>

source: <code>npm run prerender</code> does the same but it also prerenders routes defined in the <b>prerender</b> configuration in <b>angular.json</b>
fr: <code>npm run prerender</code> fait la même chose mais il pré-rend aussi les routes définies dans la configuration <b>prerender</b> dans <b>angular.json</b>

source: Features
fr: Fonctionnalités

source: Styling
fr: Style

source: <a>Spectre.css</a>, a lightweight CSS framework, is included with its set of pure CSS icons <a>Icons.css</a>.
fr: <a>Spectre.css</a>, un framework CSS léger, est inclus avec sa collection d'icônes en CSS pur <a>Icons.css</a>.

source: i18n is done with the native package. It is currently configured to be in English in the source code and to have a French translation. The exact configuration is detailed below.
fr: L'i18n est réalisée avec le paquet natif. Elle est actuellement configurée pour être en Anglais dans le code source et pour avoir une traduction en Français. La configuration exacte est détaillée plus bas.

source: Common resources
fr: Ressources courantes

source: <code>AutofocusDirective</code>: dynamically focuses an element
fr: <code>AutofocusDirective</code>: fait un focus dynamique sur un élément

source: <code>ForObjectPipe</code>: iterates through the keys of an object
fr: <code>ForObjectPipe</code>: itère à travers les clés d'un objet

source: <code>LastElementPipe</code>: returns the last element of an array
fr: <code>LastElementPipe</code>: retourne le dernier élément d'un tableau

source: <code>CoreModule</code> is supposed to contain global services and models. There are a few other useful files:
fr: <code>CoreModule</code> est censé contenir les services globaux et les modèles. Il y a plusieurs autres fichiers utiles :

source: <b>core.constants.ts</b> to store application constants (not to be confused with <b>environment.ts</b>)
fr: <b>core.constants.ts</b> pour stocker les constantes de l'application (à ne pas confondre avec <b>environment.ts</b>)

source: <b>core.utils.ts</b> to store simple functions you want to be able to use everywhere
fr: <b>core.utils.ts</b> pour stocker les fonctions simples que vous voulez pouvoir utiliser partout

source: <code>ThemeModule</code> is supposed to contain global resources which can be used in templates (components, directives, pipes, etc.). You can also find a folder named <b>styles</b> containing the following files:
fr: <code>ThemeModule</code> est censé contenir les ressources globales qui peuvent être utilisées dans les templates (composants, directives, pipes, etc.). vous pouvez aussi y trouver un dossier nommé <b>styles</b> contenant les fichiers suivants :

source: <b>custom-spectre.css.scss</b> imports and configures Spectre.css
fr: <b>custom-spectre.css.scss</b> importe et configure Spectre.css

source: <b>main.scss</b> defines global styles
fr: <b>main.scss</b> définit les styles globaux

source: <b>variables.scss</b> stores global SCSS variables
fr: <b>variables.scss</b> stocke les variables SCSS

source: This is supposed to contain modules which are likely to be imported in various places in the application.
fr: Ceci est censé contenir les modules qui sont susceptibles d'être importés à divers endroits de l'application.

source: The project has been initialized with <i>Angular CLI</i> and then modified.
fr: Le projet a été initialisé avec le <i>CLI Angular</i> puis modifié.

source: Debugging
fr: Débogage

source: <b>.vscode/launch.json</b> allows to attach the debugger to <i>Chrome</i>.
fr: <b>.vscode/launch.json</b> permet d'attacher le débogueur à <i>Chrome</i>.

source: i18n has been configured like this:
fr: L'i18n a été configurée de cette manière :

source: the source code is in English and there is a French translation
fr: le code source est en Anglais et il y a une traduction en Français

source: language files are stored in <b>src/locale</b>
fr: les fichiers de langue sont stockés dans <b>src/locale</b>

source: the build command builds all the locales configured
fr: la commande de génération génère toutes les localisations configurées

source: the base HREF is empty for the source code language and set as the language code for the translations
fr: le HREF de base est vide pour la langue du code source et défini comme le code de la langue pour les traductions

source: a missing translation throws an error and stops the build
fr: une traduction manquante lance une erreur et arrête la génération

source: Nonexistent routes are redirected to home and scroll position restoration is enabled.
fr: Les routes inexistantes sont redirigées vers l'accueil et la restauration de la position du défilement est activée.
